In [2]:
import pandas as pd
emp = {
    'ID':[123,45,32],
    'Name':['AK','ka','we'],
    'Roll':[23,45,322]
}

In [3]:
df = pd.DataFrame(emp)
df

    ID Name  Roll
0  123   AK    23
1   45   ka    45
2   32   we   322

In [4]:
df.to_csv('test.csv')

In [5]:
df.to_csv('test1.csv',index=False)

In [6]:
df.head(1)

    ID Name  Roll
0  123   AK    23

In [7]:
df.tail(1)

   ID Name  Roll
2  32   we   322

In [8]:
df.describe()

               ID        Roll
count    3.000000    3.000000
mean    66.666667  130.000000
std     49.217206  166.640331
min     32.000000   23.000000
25%     38.500000   34.000000
50%     45.000000   45.000000
75%     84.000000  183.500000
max    123.000000  322.000000

In [9]:
tr = pd.read_csv('train.csv')

In [10]:
tr

   train no   ID Name
0         0  123   AK
1         1   45   ka
2         2   32   we

In [14]:
tr['Name'][0]

'AK'

In [15]:
tr['Name'][0]='all'

C:\Users\AKASH\AppData\Local\Temp\ipykernel_1928\3232194902.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tr['Name'][0]='all'

In [16]:
tr

   train no   ID Name
0         0  123  all
1         1   45   ka
2         2   32   we

In [17]:
tr.index=['a','b','c']

In [18]:
tr

   train no   ID Name
a         0  123  all
b         1   45   ka
c         2   32   we

In [19]:
tr.to_csv('train.csv')